/********************************************************************************************************************************
 * VERSION: 2.6-Release
 * AUTHOR:  蔡沁耘@湖南大学
 * EMAIL:   hnutsai@hnu.edu.cn
 * DATE:    2020年12月16日
 * FILE:    tpsm_auxiliary.h
 * BRIEF:   TPSM并行框架Release版本(version 2.6),为TPSM_v2.5版本的精炼版本
 ********************************************************************************************************************************/


#ifndef TPSM_AUXILIARY_H
#define TPSM_AUXILIARY_H

/******************************************************************************
 * INCLUDE
 ******************************************************************************/

#include "pthread.h"


/******************************************************************************
 * PUBLIC FUNCTION
 ******************************************************************************/

/**
* @brief TPSM并行框架：获取线程序号
* @return 成功:0; 失败:1
*/
int TPSM_get_myrank(void);


/**
* @brief TPSM并行框架：获取指定同步阻塞数表序号中的同步阻塞数表的值
* @param idx 同步阻塞数表序号
* @return 成功:0; 失败:1
*/
int TPSM_get_synValueOnTag(int const idx);

#endif