/********************************************************************************************************************************
 * VERSION: 2.6-Release
 * AUTHOR:  蔡沁耘@湖南大学
 * EMAIL:   hnutsai@hnu.edu.cn
 * DATE:    2020年12月16日
 * FILE:    tpsm_distribution.h
 * BRIEF:   TPSM并行框架Release版本(version 2.6),为TPSM_v2.5版本的精炼版本
 ********************************************************************************************************************************/

#ifndef TPSM_DISTRIBUTION_H
#define TPSM_DISTRIBUTION_H


/******************************************************************************
 * INCLUDE
 ******************************************************************************/
#include "tpsm_base.h"
#include "tpsm_sysinfo.h"
#include "tpsm_default.h"

/******************************************************************************
 * PUBLIC FUNCTION
 ******************************************************************************/

/**
* @brief TPSM并行框架：初始化线程分布(平均分配线程到所有NUMA节点)
* @return 成功:0;失败:1
*/
int initializeThreadsDistribution(void);

#endif